thanhhai2k2/DemoGit/snake_stm32f401xe_CMSIS-main/snake_stm32f401xe_CMSIS-main/Core/Inc/SSD1306_OLED.h
/*
 * SSD1306_OLED.h
 *
 *  Created on: Sep 13, 2021
 *      Author: pawel
 */

#ifndef INC_SSD1306_OLED_H_
#define INC_SSD1306_OLED_H_

#include <stm32f401xe_i2c.h>


//address
#define SSD1306_ADDRESS			0x3C

// registers
#define SSD1306_REG_COMMAND 	0x00
#define SSD1306_REG_DATA		0x40

#define SSD1306_TIMEOUT			1000

#define SSD1306_COLOR_BLACK 0   ///< Draw 'off' pixels
#define SSD1306_COLOR_YELLOWBLUE 1   ///< Draw 'on' pixels
#define SSD1306_INVERSE 2 ///< Invert pixels

#define SSD1306_MEMORYMODE 0x20          ///< See datasheet
#define SSD1306_COLUMNADDR 0x21          ///< See datasheet
#define SSD1306_PAGEADDR 0x22            ///< See datasheet
#define SSD1306_SETCONTRAST 0x81         ///< See datasheet
#define SSD1306_CHARGEPUMP 0x8D          ///< See datasheet
#define SSD1306_SEGREMAP 0xA0            ///< See datasheet
#define SSD1306_DISPLAYALLON_RESUME 0xA4 ///< See datasheet
#define SSD1306_DISPLAYALLON 0xA5        ///< Not currently used
#define SSD1306_NORMALDISPLAY 0xA6       ///< See datasheet
#define SSD1306_INVERTDISPLAY 0xA7       ///< See datasheet
#define SSD1306_SETMULTIPLEX 0xA8        ///< See datasheet
#define SSD1306_DISPLAYOFF 0xAE          ///< See datasheet
#define SSD1306_DISPLAYON 0xAF           ///< See datasheet
#define SSD1306_COMSCANINC 0xC0          ///< Not currently used
#define SSD1306_COMSCANDEC 0xC8          ///< See datasheet
#define SSD1306_SETDISPLAYOFFSET 0xD3    ///< See datasheet
#define SSD1306_SETDISPLAYCLOCKDIV 0xD5  ///< See datasheet
#define SSD1306_SETPRECHARGE 0xD9        ///< See datasheet
#define SSD1306_SETCOMPINS 0xDA          ///< See datasheet
#define SSD1306_SETVCOMDETECT 0xDB       ///< See datasheet

#define SSD1306_SETLOWCOLUMN 0x00  ///< Not currently used
#define SSD1306_SETHIGHCOLUMN 0x10 ///< Not currently used
#define SSD1306_SETSTARTLINE 0x40  ///< See datasheet

#define SSD1306_EXTERNALVCC 0x01  ///< External display voltage source
#define SSD1306_SWITCHCAPVCC 0x02 ///< Gen. display voltage from 3.3V

#define SSD1306_RIGHT_HORIZONTAL_SCROLL 0x26              ///< Init rt scroll
#define SSD1306_LEFT_HORIZONTAL_SCROLL 0x27               ///< Init left scroll
#define SSD1306_VERTICAL_AND_RIGHT_HORIZONTAL_SCROLL 0x29 ///< Init diag scroll
#define SSD1306_VERTICAL_AND_LEFT_HORIZONTAL_SCROLL 0x2A  ///< Init diag scroll
#define SSD1306_DEACTIVATE_SCROLL 0x2E                    ///< Stop scroll
#define SSD1306_ACTIVATE_SCROLL 0x2F                      ///< Start scroll
#define SSD1306_SET_VERTICAL_SCROLL_AREA 0xA3             ///< Set scroll range

// Deprecated size stuff for backwards compatibility with old sketches
#define SSD1306_LCDWIDTH 128 ///< DEPRECATED: width w/SSD1306_128_64 defined
#define SSD1306_LCDHEIGHT 64 ///< DEPRECATED: height w/SSD1306_128_64 defined
#define SSD1306_BUFFERSIZE (SSD1306_LCDHEIGHT * SSD1306_LCDWIDTH/8)

#define BLACK SSD1306_COLOR_BLACK   ///< Draw 'off' pixels
#define YELLOWBLUE SSD1306_COLOR_YELLOWBLUE   ///< Draw 'on' pixels
#define INVERSE SSD1306_INVERSE   ///< Invert pixels

#define SSD1306_SWAP(a, b)                                                     \
  (((a) ^= (b)), ((b) ^= (a)), ((a) ^= (b))) ///< No-temp-var swap operation


void SSD1306_Init(I2c_Handle_t *i2c);
void SSD1306_Clear(uint8_t Color);
void SSD1306_Display(void);
void SSD1306_DrawPixel(int16_t x, int16_t y, uint8_t color);
void SSD1306_testrun(void);

#endif /* INC_SSD1306_OLED_H_ */
